<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>Title</title>
</head>
<body>
<script>



<!--    - Є змінна х, якій ви надаєте довільне числове значення.-->
<!--Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3-->

let x= +prompt('enter your number');
if (x!== 0) {
console.log('Вірно')
} else {console.log('Невірно')};

<!-- - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число-->

let time=+prompt('enter seconds');
switch (time
<!--(в першу, другу, третю или четверту частину години).-->
<!-- - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).-->

<!-- - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).-->

<!-- - Користувач вводить або має два числа.-->
<!--Потрібно знайти та вивести максимальне число з тих двох .-->
<!--Також потрібно врахувати коли введені рівні числа.-->

<!-- - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,-->
<!--за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)-->
</script>


</body>
</html>